app/Http/Controllers/AuthController.php

    public function register_store(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required',
            'email' => 'required|email:rfc,dns|unique:users,email',
            'password' => 'required|min:8',
            'password_confirmation' => 'required|same:password',
        ]);

        $validated['password'] = \Hash::make($validated['password']);

        $user = User::create($validated);
---
insert into `role_user` (`role_id`, `user_id`) values (3, 13)
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Zephr Dillard', 'quhasewyz@mailinator.com', '$2y$10$B1GI8rsO5oqPBUtPuDtNlOn4U5RVIBR0fPTmgrzhVsBc9lp/GXm9K', '2022-12-21 10:24:55', '2022-12-21 10:24:55')