app/Http/Controllers/CommentController.php

    public function store(Request $request)
    {
        $comment = Comment::create([
            'body' => $request->body,
            'post_id' => $request->post_id,
            'user_id' => rand(1, 10),
        ]);
---
insert into `comments` (`body`, `post_id`, `user_id`, `updated_at`, `created_at`) values ('Consequat Nobis rer', '1', 13, '2022-12-21 10:25:17', '2022-12-21 10:25:17')