app/Http/Controllers/PostController.php

select * from `posts` order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `posts`
---
    public function index()
    {
        $posts = Post::latest()->paginate(9);

select * from `categories`
select * from `tags`
---
    public function create()
    {
        return view('posts.create')->with([
            'categories' => Category::all(),
            'tags' => Tag::all(),
        ]);

insert into `posts` (`user_id`, `category_id`, `title`, `short_content`, `content`, `photo`, `updated_at`, `created_at`) values (13, '5', 'Ad sunt corrupti as', 'Non ipsum esse sit', 'Quia qui pariatur A', 'post-photo/Screenshot from 2022-12-21 14-22-35.png', '2022-12-21 10:26:05', '2022-12-21 10:26:05')
insert into `post_tag` (`post_id`, `tag_id`) values (42, '2')
---
    public function store(StorePostRequest $request)
    {
        if ($request->hasFile('photo')) {
            $name = $request->file('photo')->getClientOriginalName();
            $path = $request->file('photo')->storeAs('post-photos', $name);
        }

        $post = Post::create([
            'user_id' => auth()->id(),
            'category_id' => $request->category_id,
            'title' => $request->title,
            'short_content' => $request->short_content,
            'content' => $request->content,
            'photo' => $path ?? null
        ]);

        if (isset($request->tags)) {
            foreach ($request->tags as $tag) {
                $post->tags()->attach($tag);

select * from `posts` order by `created_at` desc
select * from `tags`
select * from `categories`
---
    public function show(Post $post)
    {
        $recent_posts = Post::latest()->get()->except($post->id)->take(5);
        $tags = Tag::all();
        $categories = Category::all();